nxp-mcuxpresso/mcux-soc-svd/LPC5502/LPC5502.xml
        <register>
          <name>SECURE_BOOT_CFG</name>
          <description>Secure boot configuration flags.</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSA4K</name>
              <description>Use RSA4096 keys only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Allow RSA2048 and higher</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>RSA4096 only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>RSA4096 only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>RSA4096 only</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DICE_INC_NXP_CFG</name>
              <description>Include NXP area in DICE computation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DICE_CUST_CFG</name>
              <description>Include Customer factory area (including keys) in DICE computation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIP_DICE</name>
              <description>Skip DICE computation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable DICE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable DICE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Disable DICE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Disable DICE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZM_IMAGE_TYPE</name>
              <description>TrustZone-M mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>TZ-M image mode is taken from application image header</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>TZ-M disabled image, boots to non-secure mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>TZ-M enabled image, boots to secure mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>TZ-M enabled image with TZ-M preset, boot to secure mode TZ-M pre-configured by data from application image header</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK_SET_KEY</name>
              <description>Block PUF key code generation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOW</name>
                  <description>Allow PUF Key Code generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK_ENROLL</name>
              <description>Block PUF enrollement</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOW</name>
                  <description>Allow PUF enroll operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable PUF enroll operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Disable PUF enroll operation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Disable PUF enroll operation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DICE_INC_SEC_EPOCH</name>
              <description>Include security EPOCH in DICE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIP_BOOT_SEED</name>
              <description>Skip boot seed computation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable BOOT_SEED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_INC_NXP_CFG</name>
              <description>Include NXP area in BOOT SEED computation</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_CUST_CFG</name>
              <description>Include CMPA area in BOOT SEED computation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_INC_EPOCH</name>
              <description>Include security epoch area in BOOT_SEED computation.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUD</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUD</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_BOOT_EN</name>
              <description>Secure boot enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Plain image (internal flash with or without CRC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_BASE_ADDR</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR0_PRG</name>
              <description>Programmable portion of the base address of region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR1_PRG</name>
              <description>Programmable portion of the base address of region 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR2_PRG</name>
              <description>Programmable portion of the base address of region 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_REG0</name>
              <description>Lock PRINCE region0 settings</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Region is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Region is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Region is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Region is locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_REG1</name>
              <description>Lock PRINCE region1 settings</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Region is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Region is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Region is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Region is locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG0_ERASE_CHECK_EN</name>
              <description>For PRINCE region0 enable checking whether all encrypted pages are erased together</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Region is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Region is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Region is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Region is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_ERASE_CHECK_EN</name>
              <description>For PRINCE region1 enable checking whether all encrypted pages are erased together</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Region is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Region is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Region is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Region is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_ERASE_CHECK_EN</name>
              <description>For PRINCE region2 enable checking whether all encrypted pages are erased together</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Region is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Region is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_2</name>
                  <description>Region is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_3</name>
                  <description>Region is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_SR_0</name>
          <description>Region 0, sub-region enable</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
